[{
  "_id": {
    "$oid": "648af6873407e180703a1c77"
  },
  "fileName": "Uttarakhand.txt",
  "State Name": "Uttarakhand",
  "contents": "Uttarakhand (English: /ˈʊtərɑːkʌnd/,[18] /ˌʊtərəˈkʌnd/[19] or /ˌʊtəˈrækənd/;[20] Hindi: [ˈʊtːərɑːkʰəɳɖ], lit. 'Northern Land'), also known as Uttaranchal (English: /ˌʊtəˈræntʃʌl/; the official name until 2007),[21] is a state in northern India. It is often referred to as the \"Devbhumi\" (lit. 'Land of the Gods')[22] due to its religious significance and numerous Hindu temples and pilgrimage centres found throughout the state. Uttarakhand is known for the natural environment of the Himalayas, the Bhabar and the Terai regions. It borders the Tibet Autonomous Region of China to the north; the Sudurpashchim Province of Nepal to the east; the Indian states of Uttar Pradesh to the south and Himachal Pradesh to the west and north-west. The state is divided into two divisions, Garhwal and Kumaon, with a total of 13 districts. The winter capital of Uttarakhand is Dehradun, the largest city of the state, which is a rail head. Gairsain, a town in Chamoli district, is the summer capital of Uttarakhand declared on 5 March 2020.[23][24] The High Court of the state is located in Nainital, but is to be moved to Haldwani in future.[25]\r\n\r\nArchaeological evidence supports the existence of humans in the region since prehistoric times. The region formed a part of the Uttarakuru Kingdom during the Vedic age of Ancient India. Among the first major dynasties of Kumaon were the Kunindas in the second century BCE who practiced an early form of Shaivism. Ashokan edicts at Kalsi show the early presence of Buddhism in this region. During the medieval period, the region was consolidated under the Katyuri rulers of Kumaon also known as 'Kurmanchal Kingdom'.[26] After the fall of Katyuris, the region was divided into the Kumaon Kingdom and the Garhwal Kingdom. In 1816, most of modern Uttarakhand was ceded to the British as part of the Treaty of Sugauli. Although the erstwhile hill kingdoms of Garhwal and Kumaon were traditional rivals, the proximity of different neighbouring ethnic groups and the inseparable and complementary nature of their geography, economy, culture, language, and traditions created strong bonds between the two regions, which further strengthened during the Uttarakhand movement for statehood in the 1990s.\r\n\r\nThe natives of the state are generally called Uttarakhandi, or more specifically either Garhwali or Kumaoni by their region of origin. According to the 2011 Census of India, Uttarakhand has a population of 10,086,292, making it the 20th most populous state in India.[27]"
},
{
  "_id": {
    "$oid": "648af6873407e180703a1c72"
  },
  "fileName": "Tamil Nadu.txt",
  "State Name": "Tamil Nadu",
  "contents": "Tamil Nadu (/ˌtæmɪl ˈnɑːduː/; Tamil: [ˈtamiɻ ˈnaːɽɯ] (listen), abbr. TN) is the southernmost state of India. The tenth largest Indian state by area and the sixth largest by population, Tamil Nadu is the home of the Tamil people, whose Tamil language—one of the longest surviving classical languages in the world—is widely spoken in the state and serves as its official language. The capital and largest city is Chennai.\r\n\r\nLocated on the south-eastern coast of the Indian peninsula, Tamil Nadu is defined by the lush Western Ghats and the semi-arid Deccan Plateau in the west, the discontinuous Eastern Ghats in the north, the fertile Eastern Coastal Plains lining the Bay of Bengal in the east, the Gulf of Mannar and the Palk Strait to the south-east, the Laccadive Sea at the southern cape of the peninsula—Kanyakumari, and the river Kaveri bisecting the state. Politically, Tamil Nadu is bound by the Indian states of Kerala, Karnataka, and Andhra Pradesh, and the union territory of Puducherry, as well as an international maritime border with the Northern Province of Sri Lanka at Pamban Island.\r\n\r\nHistorically, Tamil Nadu had been continuously inhabited by modern humans from 15,000 BC. The at-large Tamilakam region dominated by the Tamil-speaking population was under several regimes over centuries, such as the Sangam era (300 BC–AD 300) rulers of the Chera, Chola, and Pandya clans, the Pallava dynasty (3rd–9th century), and the later Vijayanagara Empire (14th–17th century), all of which shaped the state's cuisine, culture, and architecture. European colonization began with establishing trade ports in the 17th century, with the British controlling much of South India as the Madras Presidency, an administrative province of British India. After the Indian Independence in 1947, the region became the Madras State of the Republic of India, and in 1956, the state borders were redrawn linguistically by the States Reorganisation Act (1956) into the current shape. The state was renamed as Tamil Nadu, meaning \"Tamil Country\", in 1969.\r\n\r\nAs the most urbanised state of India, Tamil Nadu boasts an economy with gross state domestic product (GSDP) of ₹24.85 lakh crore (US$310 billion), marking the second-largest economy amongst the 28 states of India. It has the country's 9th-highest GSDP per capita of ₹225,106 (US$2,800),[7] and ranks 11th in human development index.[5] Tamil Nadu is also one of the most industrialised states, with the manufacturing sector accounting for more than one-third of the state's GDP.[8] Home to a number of ancient relics, historic buildings, religious pilgrimage spots, hill stations, forts, and three World Heritage Sites, Tamil Nadu's tourism industry is the largest among the Indian states. 15% of Tamil Nadu's forests are protected areas, hosting diverse wildlife. The Tamil film industry, nicknamed as Kollywood, plays an influential role in the state's popular culture."
},
{
  "_id": {
    "$oid": "648af6873407e180703a1c5f"
  },
  "fileName": "Bihar.txt",
  "State Name": "Bihar",
  "contents": "Bihar (/bɪˈhɑːr/; Hindi pronunciation: [bɪˈɦaːr] (listen)) is a state in eastern India. It is the third largest state by population, the 12th largest by area, and the 14th largest by GDP in 2021.[9][10][11] Bihar borders Uttar Pradesh to its west, Nepal to the north, the northern part of West Bengal to the east, and with Jharkhand to the south. The Bihar plain is split by the river Ganges, which flows from west to east.[12]\r\n\r\nOn 15 November 2000, southern Bihar was ceded to form the new state of Jharkhand.[13] Only 20% of the population of Bihar lives in urban areas as of 2021.[14] Additionally, almost 58% of Biharis are below the age of 25, giving Bihar the highest proportion of young people of any Indian state.[15] The official language is Hindi and additional language is Urdu, although other languages are common, including Maithili, Magahi, Bhojpuri, and other Languages of Bihar.\r\n\r\nIn Ancient and Classical India, the area that is now Bihar was considered the centre of political and cultural power and as a haven of learning.[16] From Magadha arose India's first empire, the Maurya empire, as well as one of the world's most widely adhered-to religions: Buddhism.[17] Magadha empires, notably under the Maurya and Gupta dynasties, unified large parts of South Asia under a central rule.[18] Another region of Bihar, Mithila, was an early centre of learning and the centre of the Videha kingdom.[19][20]\r\n\r\nHowever, since the late 1970s, Bihar has lagged far behind other Indian states in terms of social and economic development.[21] Many economists and social scientists claim that this is a direct result of the policies of the central government, such as the freight equalisation policy,[22][23] its apathy towards Bihar,[24] lack of Bihari sub-nationalism,[25] and the Permanent Settlement of 1793 by the British East India Company.[23] The state government has, however, made significant strides in developing the state.[26] Improved governance has led to an economic revival in the state through increased investment in infrastructure,[27] better healthcare facilities, greater emphasis on education, and a reduction in crime and corruption.[28]"
},
{
  "_id": {
    "$oid": "648af6873407e180703a1c61"
  },
  "fileName": "Chhattisgarh.txt",
  "State Name": "Chhattisgarh",
  "contents": "Chhattisgarh (/tʃætɪsɡɑːr/, Hindi: [ˈtʃʰət̪ːiːsgəɽʱ]) is a landlocked state in Central India. It is the ninth largest state by area, and with a population of roughly 30 million, the seventeenth most populous.[9] It borders seven states – Uttar Pradesh to the north, Madhya Pradesh to the northwest, Maharashtra to the southwest, Jharkhand to the northeast, Odisha to the east, Telangana and Andhra Pradesh to the south.[10] Formerly a part of Madhya Pradesh, it was granted statehood on 1 November 2000 with Raipur as the designated state capital.[11][12]\r\n\r\nChhattisgarh is one of the fastest-developing states in India.[13] Its Gross State Domestic Product (GSDP) is ₹3.63 lakh crore (US$45 billion), with a per capita GSDP of ₹102,762 (US$1,300).[14] A resource-rich state, it has the third largest coal reserves in the country and provides electricity, coal, and steel to the rest of the nation.[15][16] It also has the third largest forest cover in the country after Madhya Pradesh and Arunachal Pradesh with over 40% of the state covered by forests."
},
{
  "_id": {
    "$oid": "648af6873407e180703a1c64"
  },
  "fileName": "Goa.txt",
  "State Name": "Goa",
  "contents": "Goa (/ˈɡoʊə/ (listen)) is a state on the southwestern coast of India within the Konkan region, geographically separated from the Deccan highlands by the Western Ghats.[5][6] It is bound by the Indian states of Maharashtra to the north, and Karnataka to the east and south, with the Arabian Sea in the west. It is India's smallest state by area and fourth-smallest by population. Goa has the highest GDP per capita among all Indian states,[2][7] two and a half times as high as the GDP per capita of the country as a whole.[8] The Eleventh Finance Commission of India named Goa the best-placed state because of its infrastructure, and India's National Commission on Population rated it as having the best quality of life in India (based on the commission's \"12 Indicators\").[8] It is the third-highest ranking among Indian states in the human development index.[3]\r\n\r\nPanaji is the state's capital, while Vasco da Gama is its largest city. The historic city of Margão in Goa still exhibits the cultural influence of the Portuguese, who first voyaged to the subcontinent in the early 16th century as merchants, and conquered it soon thereafter, whereupon Goa became an overseas territory of the Portuguese Empire, part of what was then known as Portuguese India, and remained as such for about 456 years until it was annexed by India in 1961.[9][10] Goa's official language, which is spoken by a majority of its inhabitants, is Konkani.\r\n\r\nGoa is visited by large numbers of international and domestic tourists each year because of its white-sand beaches, active nightlife, places of worship, and World Heritage-listed architecture. It also has rich flora and fauna because it lies very close to the North Western Ghats rainforests, one of the rare biodiversity hotspots of the world."
},
{
  "_id": {
    "$oid": "648af6873407e180703a1c5e"
  },
  "fileName": "Andhra Pradesh.txt",
  "State Name": "Andhra Pradesh",
  "contents": "Andhra Pradesh (English: /ˌɑːndrə prəˈdɛʃ/,[7] Telugu: [ãːndʱrɐ prɐdeːʃ] (listen) abbr. AP) is a state in the southern coastal region of India. It is the seventh-largest state with area of 162,970 km2 (62,920 sq mi)[2] and tenth-most-populous state, with 49,577,103 [1] inhabitants.[8][9] It is bordered by Telangana to the north-west, Chhattisgarh to the north, Odisha to the north-east, Tamil Nadu to the south, Karnataka to the west and the Bay of Bengal to the east.[10] It has the second longest coastline in India of about 974 km (605 mi).[11] After existence as Andhra State and United Andhra Pradesh, the state took its present form on 2 June 2014, when the new state Telangana was formed.[12] Amaravati serves as the capital of the state with the largest city being Visakhapatnam. The state comprises 26 districts within three regions Uttarandhra, Coastal Andhra and Rayalaseema. It is also a major producer of rice. Telugu, used by majority of people and Urdu are official languages.\r\n\r\nAs per the 8th century BCE Rigvedic text Aitareya Brahmana, the Andhras left North India from the banks of the Yamuna river and migrated to South India.[13][14] In the 3rd century BCE, Andhra was a vassal kingdom of Ashoka of Mauryan Empire. After his death, Andhra became powerful and extended its empire to the whole of Maratha country and beyond under the rule of Satavahana dynasty.[15] After that, the major rulers included Pallavas, Eastern Chalukyas, Kakatiyas, Vijayanagara Empire, Qutb Shahi dynasty, Nizam of Hyderabad, East India Company and British Raj.\r\n\r\nAndhra Pradesh is ranked 3 in the domestic tourist footfalls for the year 2021, with 9.32 crore domestic tourists, which amounts to 13.8% of all India domestic tourists. The Tirumala Venkateswara Temple near Tirupati is one of the world's most visited religious sites, with 18.25 million visitors per year.[16] The region is also home to a variety of other pilgrimage centres, such as the Pancharama Kshetras, Mallikarjuna Jyotirlinga, Kodanda Rama Temple, Amaravati and Nagarjunakonda. The state's natural attractions include the beaches along its coast, hill stations such as the Araku Valley and Horsley Hills, and Konaseema delta."
},
{
  "_id": {
    "$oid": "648af6873407e180703a1c60"
  },
  "fileName": "Assam.txt",
  "State Name": "Assam",
  "contents": "Assam (/əˈsæm, æ-/;[9][10] Assamese: [ˈɔxɔm] (listen)) is a state in northeastern India, south of the eastern Himalayas along the Brahmaputra and Barak River valleys. Assam covers an area of 78,438 km2 (30,285 sq mi). The state is bordered by Bhutan and Arunachal Pradesh to the north; Nagaland and Manipur to the east; Meghalaya, Tripura, Mizoram and Bangladesh to the south; and West Bengal to the west via the Siliguri Corridor, a 22-kilometre-wide (14 mi) strip of land that connects the state to the rest of India. Assamese and Boro are the official languages of Assam, while Bengali is an additional official language in the Barak Valley.\r\n\r\nAssam is known for Assam tea and Assam silk. The state was the first site for oil drilling in Asia.[11] Assam is home to the one-horned Indian rhinoceros, along with the wild water buffalo, pygmy hog, tiger and various species of Asiatic birds, and provides one of the last wild habitats for the Asian elephant. The Assamese economy is aided by wildlife tourism to Kaziranga National Park and Manas National Park, which are World Heritage Sites. Dibru-Saikhowa National Park is famed for its feral horses. Sal tree forests are found in the state which, as a result of abundant rainfall, look green all year round. Assam receives more rainfall than most parts of India; this rain feeds the Brahmaputra River, whose tributaries and oxbow lakes provide the region with a distinctive hydro-geomorphic environment."
},
{
  "_id": {
    "$oid": "648af6873407e180703a1c70"
  },
  "fileName": "Nagaland.txt",
  "State Name": "Nagaland",
  "contents": "Nagaland (/ˈnɑːɡəlænd/) is a landlocked state in the north-eastern region of India. It is bordered by the Indian states of Arunachal Pradesh to the north, Assam to the west, Manipur to the south, and the Sagaing Region of Myanmar (Burma) to the east. Its capital city is Kohima and its largest city is the twin Chümoukedima–Dimapur. The state has an area of 16,579 square kilometres (6,401 sq mi) with a population of 1,980,602 as per the 2011 Census of India, making it one of the smallest states of India.[3]\r\n\r\nNagaland is home to diverse indigenous ethnic groups, each with its distinct customs, traditions, and languages. The land has been inhabited by various indigenous ethnic groups for centuries. The earliest recorded history of Nagaland dates back to the 13th century. In the 19th century, British colonial forces began expanding their influence in Northeast India, including the Naga Hills. The British encountered fierce resistance from the Nagas who opposed foreign rule.\r\n\r\nAfter India's independence in 1947, the question of the Naga Hills' political status emerged. The Naga National Council, led by Zapu Phizo, demanded an independent Naga nation and launched an armed struggle for an independent state. The Indian Government, however, maintained that Nagaland was an integral part of India. The conflict between the Naga National Council and the Indian Government resulted in a protracted insurgency that lasted for several decades limiting its economic development. It became the 16th state of India on 1 December 1963.\r\n\r\nNagaland is home to a rich variety of natural, cultural, and environmental resources. It is a mountainous state and lies between the parallels of 95° and 94° eastern longitude and 25.2° and 27.0° latitude north. The high-profile Dzüko Valley is at Viswema, in the southern region of the state. The state has significant resources of natural minerals, petroleum, and hydropower, with agriculture as the state's most important economic activity, accounting for over 70% of its economy. Other significant activities include forestry, tourism, insurance, real estate, horticulture, and miscellaneous cottage industries.[4][5][6]"
},
{
  "_id": {
    "$oid": "648af6873407e180703a1c74"
  },
  "fileName": "Telangana.txt",
  "State Name": "Telangana",
  "contents": "Telangana (/ˌtɛlənˈɡɑːnə/ (listen); Telugu: [ˈtelaŋɡaːɳa], Urdu: [ˈtɪləŋɡɑːna] (listen)) is a state in India situated on the south-central stretch of the Indian peninsula on the high Deccan Plateau.[12] It is the eleventh-largest state and the twelfth-most populated state in India with a geographical area of 112,077 km2 (43,273 sq mi) and 35,193,978 residents as per 2011 census.[13] On 2 June 2014, the area was separated from the northwestern part of Andhra Pradesh as the newly formed state of Telangana, with Hyderabad as its capital.\r\n\r\nThroughout antiquity and the Middle Ages, the region now known as Telangana was ruled by multiple major Indian powers such as the Mauryans, Satavahanas, Vishnukundinas, Chalukyas, Cholas, Rashtrakutas, Kakatiyas, Delhi Sultanate, Bahmani Sultanate, Golconda Sultanate. During the 16th and 17th centuries, the region was ruled by the Mughals of India.[14] The region is known for its Ganga-Jamuni tehzeeb culture.[15] During the 18th century and the British Raj, Telangana was ruled by the Nizam of Hyderabad.[16] In 1823, the Nizams lost control over Northern Circars (Coastal Andhra) and Ceded Districts (Rayalseema), which were handed over to the East India Company. The annexation by the British of the Northern Circars deprived Hyderabad State, the Nizam's dominion, of the considerable coastline it formerly had, to that of a landlocked princely state with territories in the central Deccan, bounded on all sides by British India. Thereafter, the Northern Circars were governed as part of Madras Presidency until India's independence in 1947, after which the presidency became India's Madras state.[17]\r\n\r\nThe Hyderabad state joined the Union of India in 1948 after a police action. In 1956, the Hyderabad State was dissolved as part of the linguistic reorganization of states and Telangana was merged with the Telugu-speaking Andhra State (part of the Madras Presidency during the British Raj) to form Andhra Pradesh. A peasant-driven movement began to advocate for separation from Andhra Pradesh starting in the early 1950s, and continued until Telangana was granted statehood on 2 June 2014 under the leadership of K. Chandrashekar Rao.[18]\r\n\r\nThe economy of Telangana is the seventh-largest in India, with a gross state domestic product (GSDP) of ₹13.25 trillion (US$170 billion) and has GSDP per capita of ₹320,000 (US$4,000).[19][20] Telangana has scored 0.705 human development index.[9] The state has emerged as a major focus for robust IT software, industry and services sector. The state is also the main administrative Centre of many Indian defence aerospace and research labs like Bharat Dynamics Limited, Defence Metallurgical Research Laboratory, Defense Research and Development Organization and Defence Research and Development Laboratory.[21]\r\n\r\nHyderabadi cuisine and Kakatiya architecture both from Telangana, are on the list of creativity UNESCO creative city of gastronomy and UNESCO World Heritage Site. The cultural centers of Telangana, Hyderabad and Warangal, are noted for their wealth and renowned historical structures – Ramappa Temple (UNESCO World Heritage Site), Charminar, Qutb Shahi Tombs, Falaknuma Palace, Chowmahalla Palace, Warangal Fort, Kakatiya Kala Thoranam, Thousand Pillar Temple and the Bhongir Fort in Yadadri Bhuvanagiri district. The historic city Golconda in Hyderabad established itself as a diamond trading Centre and, until the end of the 19th century, the Golconda market was the primary source of the finest and largest diamonds in the world. Thus, the legendary name Golconda Diamonds became synonymous with Golconda itself. Religious edifices like the Lakshmi Narasimha Temple in Yadadri Bhuvanagiri district, Makkah Masjid in Hyderabad, the ancient Bhadrakali Temple and Govinda Rajula Gutta in Warangal, Alampur Jogulamba Temple in Jogulamba Gadwal district and Medak Cathedral, Kondagattu Anjaneya Swamy Temple, Kondagattu Veerabhadra Swamy Temple, Lord Shiva temple in Vemulawada of Rajanna-Sircilla district are several of its most famous places of worship. Buddhism also flourished in the region and many Aramams can be found."
},
{
  "_id": {
    "$oid": "648af6873407e180703a1c79"
  },
  "fileName": "West Bengal.txt",
  "State Name": "West Bengal",
  "contents": "West Bengal (/bɛnˈɡɔːl/, Bengali: Poshchim Bongo, pronounced [ˈpoʃtʃim ˈbɔŋɡo] (listen), abbr. WB) is a state in the eastern portion of India. It is situated along the Bay of Bengal, along with a population of over 91 million inhabitants within an area of 88,752 km2 (34,267 sq mi). West Bengal is the fourth-most populous and thirteenth-largest state by area in India, as well as the eighth-most populous country subdivision of the world. As a part of the Bengal region of the Indian subcontinent, it borders Bangladesh in the east, and Nepal and Bhutan in the north. It also borders the Indian states of Jharkhand, Odisha, Bihar, Sikkim and Assam. The state capital is Kolkata, the third-largest metropolis, and seventh largest city by population in India. West Bengal includes the Darjeeling Himalayan hill region, the Ganges delta, the Rarh region, the coastal Sundarbans and the Bay of Bengal. The state's main ethnic group are the Bengalis, with the Bengali Hindus forming the demographic majority.\r\n\r\nThe area's early history featured a succession of Indian empires, internal squabbling, and a tussle between Hinduism and Buddhism for dominance. Ancient Bengal was the site of several major Janapadas, while the earliest cities date back to the Vedic period. The region was part of several ancient pan−Indian empires, including the Vangas, Mauryans, and the Guptas. The citadel of Gauḍa served as the capital of the Gauḍa Kingdom, the Pala Empire, and the Sena Empire. Islam was introduced through trade with the Abbasid Caliphate, but following the Ghurid conquests led by Bakhtiyar Khalji and the establishment of the Delhi Sultanate, the Muslim faith spread across the entire Bengal region. During the Bengal Sultanate, the territory was a major trading nation in the world, and was often referred by the Europeans as the \"richest country to trade with\". It was absorbed into the Mughal Empire in 1576. Simultaneously, some parts of the region were ruled by several Hindu states, and Baro-Bhuyan landlords, and part of it was briefly overrun by the Suri Empire. Following the death of Emperor Aurangzeb in the early 1700s, the proto-industrialised Mughal Bengal became a semi-independent state under the Nawabs of Bengal, and showed signs of the first Industrial revolution.[10][11] The region was later annexed into the Bengal Presidency by the British East India Company after the Battle of Buxar in 1764.[12][13] From 1772 to 1911, Calcutta was the capital of all of East India Company's territories and then the capital of the entirety of India after the establishment of the Viceroyalty. From 1912 to India's Independence in 1947, it was the capital of the Bengal Province.\r\n\r\nThe region was a hotbed of the Indian independence movement and has remained one of India's great artistic and intellectual centres.[14] Following widespread religious violence, the Bengal Legislative Council and the Bengal Legislative Assembly voted on the Partition of Bengal in 1947 along religious lines into two independent dominions: West Bengal, a Hindu-majority Indian state, and East Bengal, a Muslim-majority province of Pakistan which later became the independent Bangladesh. The early and prolonged exposure to British administration resulted in an expansion of Western education, culminating in developments in science, institutional education, and social reforms in the region, including what became known as the Bengali Renaissance. Several regional and pan−Indian empires throughout Bengal's history have shaped its culture, cuisine, and architecture.\r\n\r\nPost-Indian independence, as a welfare state, West Bengal's economy is based on agricultural production and small and medium-sized enterprises.[15] The state's cultural heritage, besides varied folk traditions, ranges from stalwarts in literature including Nobel-laureate Rabindranath Tagore to scores of musicians, film-makers and artists. For several decades, the state underwent political violence and economic stagnation before it rebounded.[16] In 2023–24, the economy of West Bengal is the sixth-largest state economy in India with a gross state domestic product (GSDP) of ₹17.19 lakh crore (US$220 billion),[4] and has the country's 20th-highest GSDP per capita of ₹121,267 (US$1,500).[5] Despite being one of the fastest-growing major economies, West Bengal has struggled to attract foreign direct investment due to adverse land acquisition policies, poor infrastructure, and red tape.[17][18] It also has the 28th-highest ranking among Indian states in human development index, with the index value being lower than the Indian average.[6] The state government debt of ₹6.47 lakh crore (US$81 billion), or 37.67% of GSDP, has dropped from 40.65% since 2010–11.[19][4] There is moderate unemployment.[20] West Bengal has two World Heritage sites and ranks as the seventh-most visited tourist destination in India.[21][22]"
},
{
  "_id": {
    "$oid": "648af6873407e180703a1c62"
  },
  "fileName": "Arunachal Pradesh.txt",
  "State Name": "Arunachal Pradesh",
  "contents": "Arunachal Pradesh (/ɑːrəˌnɑːtʃəl prəˈdɛʃ/,[19] lit. 'Land of Dawn-Lit Mountains')[20] is a state in Northeastern India. It was formed from the erstwhile North-East Frontier Agency (NEFA) region, and became a state on 20 February 1987. Itanagar is the state capital and its largest town.\r\n\r\nArunachal Pradesh is the largest of the Seven Sister States of Northeast India by area. It borders the states of Assam and Nagaland to the south. It shares international borders with Bhutan in the west, Myanmar in the east, and a disputed 1,129 km border with China's Tibet Autonomous Region in the north at the McMahon Line.[21][22]\r\n\r\nAs of the 2011 Census of India, Arunachal Pradesh has a population of 1,382,611 and an area of 83,743 square kilometres (32,333 sq mi). It is an ethnically diverse state, with predominantly Monpa people in the west, Tani people in the centre, Mishmi and Tai people in the east, and Naga people in the southeast of the state. About 26 major tribes and 100 sub-tribes live in the state,[citation needed] including Adi, Nyshi, Singpho, Galo, Tagin and Apatani. The Mishmi tribe has three sub-tribes, namely Idu-Mishmi, Digaru-Mishmi and Miju-Mishmi.\r\n\r\nA major part of the state is claimed by the People's Republic of China, which refers to it as \"Zangnan,\" (lit. \"South Tibet\").[23] China occupied a part of Arunachal Pradesh in 1962 but later withdrew its forces.[24][25]"
},
{
  "_id": {
    "$oid": "648af6873407e180703a1c63"
  },
  "fileName": "Gujarat.txt",
  "State Name": "Gujarat",
  "contents": "Gujarat (/ˌɡʊdʒəˈrɑːt/ GUUJ-ə-RAHT, Gujarati: [ˈɡudʒəɾat̪] (listen)) is a state along the western coast of India. Its coastline of about 1,600 km (990 mi) is the longest in the country, most of which lies on the Kathiawar peninsula. Gujarat is the fifth-largest Indian state by area, covering some 196,024 km2 (75,685 sq mi); and the ninth-most populous state, with a population of 60.4 million. It is bordered by Rajasthan to the northeast, Dadra and Nagar Haveli and Daman and Diu to the south, Maharashtra to the southeast, Madhya Pradesh to the east, and the Arabian Sea and the Pakistani province of Sindh to the west. Gujarat's capital city is Gandhinagar, while its largest city is Ahmedabad.[12] The Gujaratis are indigenous to the state and their language, Gujarati, is the state's official language.\r\n\r\nThe state encompasses 23 sites of the ancient Indus Valley civilisation (more than any other state). The most important sites are Lothal (the world's first dry dock), Dholavira (the fifth largest site), and Gola Dhoro (where 5 uncommon seals were found). Lothal is believed to have been one of the world's first seaports.[13] Gujarat's coastal cities, chiefly Bharuch and Khambhat,[14] served as ports and trading centres in the Maurya and Gupta empires, and during the succession of royal Saka dynasties in the Western Satraps era.[15][16] Along with Bihar, Mizoram and Nagaland, Gujarat is one of four Indian states to prohibit the sale of alcohol.[17] The Gir Forest National Park in Gujarat is home to the only wild population of the Asiatic lion in the world.[18]\r\n\r\nThe economy of Gujarat is the fourth-largest in India, with a gross state domestic product (GSDP) of ₹16.55 trillion (US$210 billion) and has the country's 10th-highest GSDP per capita of ₹215,000 (US$2,700).[6] Gujarat ranks 21st among Indian states and union territories in human development index.[19] Gujarat is regarded as one of the most industrialised states and has a low unemployment rate,[20] but the state ranks poorly on some social indicators and is at times affected by religious violence.[21]"
},
{
  "_id": {
    "$oid": "648af6873407e180703a1c65"
  },
  "fileName": "Haryana.txt",
  "State Name": "Haryana",
  "contents": "Haryana (/hʌriˈɑːnə/; Hindi: [ɦəɾɪˈjɑːɳɑː]) is an Indian state located in the northern part of the country. It was carved out of the former state of East Punjab on 1 November 1966 on a linguistic basis. It is ranked 21st in terms of area, with less than 1.4% (44,212 km2 or 17,070 sq mi) of India's land area.[1][12] The state capital is Chandigarh, which it shares with the neighboring state of Punjab, and the most populous city is Faridabad, which is a part of the National Capital Region. The city of Gurgaon is among India's largest financial and technology hubs.[13] Haryana has 6 administrative divisions, 22 districts, 72 sub-divisions, 93 revenue tehsils, 50 sub-tehsils, 140 community development blocks, 154 cities and towns, 7,356 villages, and 6,222 villages panchayats.[12][14]\r\n\r\nHaryana contains 32 special economic zones (SEZs), mainly located within the industrial corridor projects connecting the National Capital Region.[12][15] Gurgaon is considered one of the major information technology and automobile hubs of India.[16][17] Haryana ranks 11th among Indian states in human development index.[5] The economy of Haryana is the 13th largest in India, with a gross state domestic product (GSDP) of ₹7.65 trillion (US$96 billion) and has the country's 5th-highest GSDP per capita of ₹240,000 (US$3,000).[4]\r\n\r\nThe state is rich in history, monuments, heritage, flora and fauna and tourism, with a well-developed economy, national highways and state roads. It is bordered by Punjab and Himachal Pradesh to the north, by Rajasthan to the west and south, while river Yamuna forms its eastern border with Uttar Pradesh. Haryana surrounds the country's capital territory of Delhi on three sides (north, west and south), consequently, a large area of Haryana state is included in the economically important National Capital Region of India for the purposes of planning and development."
},
{
  "_id": {
    "$oid": "648af6873407e180703a1c66"
  },
  "fileName": "Karnataka.txt",
  "State Name": "Karnataka",
  "contents": "Karnataka (/kərˈnɑːtəkə/; ISO: Karnāṭaka, Kannada pronunciation: [kɐˈɾnäːʈɐkɐ], also known as Karunāḍu), formerly Mysore State /maɪˈsɔːr/, is a state in the southwestern region of India. It was formed as Mysore State on 1 November 1956, with the passage of the States Reorganisation Act, and renamed Karnataka in 1973. The state was part of the Carnatic region in British terminology. Its capital and largest city is Bengaluru (Bangalore).\r\n\r\nKarnataka is bordered by the Lakshadweep Sea to the west, Goa to the northwest, Maharashtra to the north, Telangana to the northeast, Andhra Pradesh to the east, Tamil Nadu to the southeast, and Kerala to the southwest. It is the only southern state to have land borders with all of the other four southern Indian sister states. The state covers an area of 191,791 km2 (74,051 sq mi), or 5.83 percent of the total geographical area of India.[12] It is the sixth-largest Indian state by area.[12] With 61,130,704 inhabitants at the 2011 census, Karnataka is the eighth-largest state by population, comprising 31 districts. Kannada, one of the classical languages of India, is the most widely spoken and official language of the state. Other minority languages spoken include Urdu, Konkani, Marathi, Tulu, Tamil, Telugu, Malayalam, Kodava and Beary. Karnataka also contains some of the only villages in India where Sanskrit is primarily spoken.[13][14][15]\r\n\r\nThough several etymologies have been suggested for the name Karnataka, the generally accepted one is that Karnataka is derived from the Kannada words karu and nādu, meaning \"elevated land\". Karu Nadu may also be read as karu, meaning \"black\" and nadu, meaning \"region\", as a reference to the black cotton soil found in the Bayalu Seeme region of the state. The British used the word Carnatic, sometimes Karnatak, to describe both sides of peninsular India, south of the Krishna.[16]\r\n\r\nWith an antiquity that dates to the paleolithic, Karnataka has been home to some of the most powerful empires of ancient and medieval India. The philosophers and musical bards patronised by these empires launched socio-religious and literary movements which have endured to the present day. Karnataka has contributed significantly to both forms of Indian classical music, the Carnatic and Hindustani traditions.\r\n\r\nThe economy of Karnataka is the fifth-largest of any Indian state with ₹20.5 trillion (US$260 billion) in gross domestic product and a per capita GDP of ₹305,000 (US$3,800).[8] Karnataka has the fifteenth-highest ranking among Indian states in Human Development Index.[9]"
},
{
  "_id": {
    "$oid": "648af6873407e180703a1c6a"
  },
  "fileName": "Manipur.txt",
  "State Name": "Manipur",
  "contents": "Manipur (/ˌmʌnɪˈpʊər/,[8] US also /ˌmænɪˈpʊər/:[9] Meitei: Kangleipak[a][10][11][12]) is a state in northeast India, with the city of Imphal as its capital.[13] It is bounded by the Indian states of Nagaland to the north, Mizoram to the south and Assam to the west. It also borders two regions of Myanmar, Sagaing Region to the east and Chin State to the south. The state covers an area of 22,327 km2 (8,621 sq mi). The official and most widely spoken language is Meitei language (officially known as Manipuri language). Native to the Meitei people, it is also used as a lingua franca by smaller communities, who speak a variety of other Sino-Tibetan languages.[14] Manipur has been at the crossroads of Asian economic and cultural exchange for more than 2,500 years.[15] It connects the Indian subcontinent and Central Asia to Southeast Asia, East Asia, Siberia, regions in the Arctic, Micronesia and Polynesia enabling migration of people, cultures and religions.[16][17]\r\n\r\nDuring the days of the British Indian Empire, the Kingdom of Manipur was one of the princely states.[18] Between 1917 and 1939, some people of Manipur pressed the princely rulers for democracy. By the late 1930s, the princely state of Manipur negotiated with the British administration its preference to continue to be part of the Indian Empire, rather than part of Burma, which was being separated from India. These negotiations were cut short with the outbreak of World War II in 1939. On 11 August 1947, Maharaja Budhachandra signed an Instrument of Accession, joining India.[19][20] Later, on 21 September 1949, he signed a Merger Agreement, merging the kingdom into India, which led to its becoming a Part C State.[21][22] This merger was later disputed by groups in Manipur, as having been completed without consensus and under duress.[23] The dispute and differing visions for the future has resulted in a 50-year insurgency in the state for independence from India, as well as in repeated episodes of violence among ethnic groups in the state.[24] From 2009 through 2018, the conflict was responsible for the violent deaths of over 1000 people.[25]\r\n\r\nThe Meitei people[26] represent around 53% of the population of Manipur state, followed by various Naga ethnic groups at 24% and various Kuki/Zo tribes (also known as Chin-Kuki-Mizo people) at 16%.[27] Manipur's ethnic groups practice a variety of religions.[28] According to 2011 census, Hinduism and Christianity are the major religions of the state.[28][29] Between the 1961 and 2011 censuses of India, the share of Hindus in the state declined from 62% to 41%, while the share of Christians rose from 19% to 41%.[30]\r\n\r\nManipur has primarily an agrarian economy, with significant hydroelectric power generation potential. It is connected to other areas by daily flights through Imphal airport, the second largest in northeastern India.[31] Manipur is home to many sports and the origin of Manipuri dance,[32] and is credited with introducing polo to Europeans.[33]"
},
{
  "_id": {
    "$oid": "648af6873407e180703a1c67"
  },
  "fileName": "Kerala.txt",
  "State Name": "Kerala",
  "contents": "Kerala (English: /ˈkɛrələ/ KERR-ə-lə; Malayalam: [ke:ɾɐɭɐm] (listen)) is a state on the Malabar Coast of India.[15] It was formed on 1 November 1956, following the passage of the States Reorganisation Act, by combining Malayalam-speaking regions of the erstwhile regions of Cochin, Malabar, South Canara, and Travancore.[16][17] Spread over 38,863 km2 (15,005 sq mi), Kerala is the 21st largest Indian state by area. It is bordered by Karnataka to the north and northeast, Tamil Nadu to the east and south, and the Lakshadweep Sea[18] to the west. With 33 million inhabitants as per the 2011 census, Kerala is the 13th-largest Indian state by population. It is divided into 14 districts with the capital being Thiruvananthapuram. Malayalam is the most widely spoken language and is also the official language of the state.[19]\r\n\r\nThe Chera dynasty was the first prominent kingdom based in Kerala. The Ay kingdom in the deep south and the Ezhimala kingdom in the north formed the other kingdoms in the early years of the Common Era (CE). The region had been a prominent spice exporter since 3000 BCE. The region's prominence in trade was noted in the works of Pliny as well as the Periplus around 100 CE. In the 15th century, the spice trade attracted Portuguese traders to Kerala, and paved the way for European colonisation of India. At the time of Indian independence movement in the early 20th century, there were two major princely states in Kerala: Travancore and Cochin. They united to form the state of Thiru-Kochi in 1949. The Malabar region, in the northern part of Kerala, had been a part of the Madras province of British India, which later became a part of the Madras State post-independence. After the States Reorganisation Act, 1956, the modern-day state of Kerala was formed by merging the Malabar district of Madras State (excluding Gudalur taluk of Nilgiris district, Lakshadweep Islands, Topslip, the Attappadi Forest east of Anakatti), the taluk of Kasaragod (now Kasaragod District) in South Canara, and the erstwhile state of Thiru-Kochi (excluding four southern taluks of Kanyakumari district, and Shenkottai taluks).[17]\r\n\r\nKerala has the lowest positive population growth rate in India, 3.44%; the highest Human Development Index (HDI), 0.784 in 2018 (0.712 in 2015); the highest literacy rate, 96.2% in the 2018 literacy survey conducted by the National Statistical Office, India;[10] the highest life expectancy, 77.3 years; and the highest sex ratio, 1,084 women per 1,000 men. Kerala is the least impoverished state in India according to NITI Aayog's Sustainable Development Goals dashboard and Reserve Bank of India's 'Handbook of Statistics on Indian Economy'.[20][21] Kerala is the second-most urbanised major state in the country with 47.7% urban population according to the 2011 Census of India.[22] The state topped in the country to achieve the Sustainable Development Goals according to the annual report of NITI Aayog published in 2019.[23] The state has the highest media exposure in India with newspapers publishing in nine languages, mainly Malayalam and sometimes English. Hinduism is practised by more than half of the population, followed by Islam and Christianity.\r\n\r\nThe economy of Kerala is the 8th-largest in India with ₹8.55 trillion (US$110 billion) in gross state domestic product (GSDP) and a per capita net state domestic product of ₹222,000 (US$2,800).[24] The tertiary sector contributes around 65% to state's GSVA, while the primary sector contributes only 8%.[25] The state has witnessed significant emigration, especially to the Arab states of the Persian Gulf during the Gulf Boom of the 1970s and early 1980s, and its economy depends significantly on remittances from a large Malayali expatriate community. The production of pepper and natural rubber contributes significantly to the total national output. In the agricultural sector, coconut, tea, coffee, cashew and spices are important. The state is situated between Arabian Sea to the west and Western Ghats mountain ranges to the east. The state's coastline extends for 595 kilometres (370 mi), and around 1.1 million people in the state are dependent on the fishery industry which contributes 3% to the state's income. Named as one of the ten paradises of the world by National Geographic Traveler,[26] Kerala is one of the prominent tourist destinations of India, with coconut-lined sandy beaches, backwaters, hill stations, Ayurvedic tourism and tropical greenery as its major attractions."
},
{
  "_id": {
    "$oid": "648af6873407e180703a1c68"
  },
  "fileName": "Jharkhand.txt",
  "State Name": "Jharkhand",
  "contents": "Jharkhand (/ˈdʒɑːrkənd/;[8] Hindi: [d͡ʒʱɑːɾkʰəɳɖ]; lit. 'the land of forests') is a state in eastern India.[9] The state shares its border with the states of West Bengal to the east, Chhattisgarh to the west, Uttar Pradesh to the northwest, Bihar to the north and Odisha to the south. It has an area of 79,716 km2 (30,779 sq mi). It is the 15th largest state by area, and the 14th largest by population. Hindi is the official language of the state.[3] The city of Ranchi is its capital and Dumka its sub-capital. The state is known for its waterfalls, hills and holy places; Baidyanath Dham, Parasnath, Dewri and Rajrappa are major religious sites.[10][11]\r\n\r\nJharkhand suffers from what is sometimes termed a resource curse:[12] it accounts for more than 40% of the mineral resources of India,[13] but 39.1% of its population is below the poverty line and 19.6% of children under five years of age are malnourished.[14] Jharkhand is primarily rural, with about 24% of its population living in cities.[15] It is amongst the leading states in terms of economic growth. In 2017–18, the GDP growth rate of state was at 10.22%.[16]"
},
{
  "_id": {
    "$oid": "648af6873407e180703a1c75"
  },
  "fileName": "Tripura.txt",
  "State Name": "Tripura",
  "contents": "Tripura (/ˈtrɪpʊrə, -ərə/, Bengali:[ˈtri̯puraˈ] )[10] is a state in Northeast India. The third-smallest state in the country, it covers 10,491 km2 (4,051 sq mi); and the seventh-least populous state with a population of 36.71 lakh (3.67 million).[11] It is bordered by Assam and Mizoram to the east and by Bangladesh to the north, south and west.[12] Tripura is divided into 8 districts and 23 sub-divisions, where Agartala is the capital and the largest city in the state. Tripura has 19 different tribal communities[13] with a majority Bengali population. Bengali, English and Kokborok are the state's official languages.[7]\r\n\r\nThe area of modern Tripura — ruled for several centuries by the Manikya Dynasty — was part of the Tripuri Kingdom (also known as Hill Tippera). It became a princely state under the British Raj during its tenure, and acceded to independent India in 1947. It merged with India in 1949 and was designated as a 'Part C State' (union territory).[14] It became a full-fledged state of India in 1972.\r\n\r\nTripura lies in a geographically isolated location in India, as only one major highway, National Highway 8, connects it with the rest of the country. Five mountain ranges — Hathai Kotor, Atharamura, Longtharai, Shakhan and Jampui Hills — run north to south, with intervening valleys; Agartala, the capital, is located on a plain to the west. The state has a tropical savanna climate, and receives seasonal heavy rains from the south west monsoon.\r\n\r\nForests cover more than half of the area, in which bamboo and cane tracts are common. Tripura has the highest number of primate species found in any Indian state. Due to its geographical isolation, economic progress in the state is hindered. Poverty and unemployment continue to plague Tripura, which has a limited infrastructure. Most residents are involved in agriculture and allied activities, although the service sector is the largest contributor to the state's gross domestic product.\r\n\r\nAccording to the 2011 census, Tripura is one of the most literate states in India, with a literacy rate of 87.75%. Mainstream Indian cultural elements coexist with traditional practices of the ethnic groups, such as various dances to celebrate religious occasions, weddings and festivities; the use of locally crafted musical instruments and clothes; and the worship of regional deities. The sculptures at the archaeological sites Unakoti, Pilak and Devtamura provide historical evidence of artistic fusion between organised and indigenous religions."
},
{
  "_id": {
    "$oid": "648af6873407e180703a1c78"
  },
  "fileName": "Meghalaya.txt",
  "State Name": "Meghalaya",
  "contents": "Meghalaya (/ˌmeɪɡəˈleɪə/,[7] or /meɪˈɡɑːləjə/,[8] meaning \"abode of clouds\"; from Sanskrit megha, \"cloud\" + ā-laya, \"abode\") is a state in northeast India. Meghalaya was formed on 21 January 1972 by carving out two districts from the state of Assam: (a) the United Khasi Hills and Jaintia Hills and (b) the Garo Hills.[9] The population of Meghalaya as of 2014 is estimated to be 3,211,474.[10] Meghalaya covers an area of approximately 22,429 square kilometres, with a length-to-breadth ratio of about 3:1.[11]\r\n\r\nThe state is bound to the south by the Bangladeshi divisions of Mymensingh and Sylhet, to the west by the Bangladeshi division of Rangpur, and to the north and east by India's State of Assam. The capital of Meghalaya is Shillong. During the British rule of India, the British imperial authorities nicknamed it the \"Scotland of the East\".[12] English is the official language of Meghalaya. Unlike many Indian states, Meghalaya has historically followed a matrilineal system where the lineage and inheritance are traced through women; the youngest daughter inherits all wealth and she also takes care of her parents.[12]\r\n\r\nThe state is the wettest region of India, with the wettest areas in the southern Khasi Hills recording an average of 12,000 mm (470 in) of rain a year.[11] About 70 per cent of the state is forested.[13] The Meghalaya subtropical forests ecoregion encompasses the state; its mountain forests are distinct from the lowland tropical forests to the north and south. The forests are notable for their biodiversity of mammals, birds, and plants.\r\n\r\nMeghalaya has predominantly an agrarian economy with a significant commercial forestry industry. The important crops are potatoes, rice, maize, pineapples, bananas, papayas, and spices. The service sector is made up of real estate and insurance companies. Meghalaya's gross state domestic product for 2012 was estimated at ₹16,173 crore (US$2.0 billion) in current prices.[14] The state is geologically rich in minerals, but it has no significant industries.[12] The state has about 1,170 km (730 mi) of national highways. It is also a major logistical center for trade with Bangladesh.[11]\r\n\r\nIn July 2018, the International Commission on Stratigraphy divided the Holocene epoch into three,[15][16] with the late Holocene being called the Meghalayan stage/age,[17][18] since a speleothem in Mawmluh cave indicating a dramatic worldwide climate event around 2250 BCE had been chosen as the boundary stratotype.[19]\r\n\r\nOne of the biggest Central Institutes, the North Eastern Council Secretariat, is also situated in Shillong."
},
{
  "_id": {
    "$oid": "648af6873407e180703a1c69"
  },
  "fileName": "Madhya Pradesh.txt",
  "State Name": "Madhya Pradesh",
  "contents": "Madhya Pradesh (/ˌmədjə prəˈdɛʃ/,[9] Hindi: [ˈməd̪ʱjə pɾəˈdeːʃ] (listen); meaning 'central province') is a state in central India. Its capital is Bhopal, and the largest city is Indore, with Jabalpur, Ujjain, Gwalior, Dewas, Sagar, Satna, Narmadapuram, Shahdol, Rewa and Morena being the other major cities. Madhya Pradesh is the second largest Indian state by area and the fifth largest state by population with over 72 million residents. It borders the states of Uttar Pradesh to the northeast, Chhattisgarh to the east, Maharashtra to the south, Gujarat to the west, and Rajasthan to the northwest.[10]\r\n\r\nThe area covered by the present-day Madhya Pradesh includes the area of the ancient Avanti Mahajanapada, whose capital Ujjain (also known as Avantika) arose as a major city during the second wave of Indian urbanisation in the sixth century BCE. Subsequently, the region was ruled by the major dynasties of India. The Maratha Empire dominated the majority of the 18th century. After the Anglo-Maratha Wars in the 19th century, the region was divided into several princely states under the British and incorporated into Central Provinces and Berar and the Central India Agency. Some years after India's independence, the Central Provinces and Berar was renamed as Madhya Pradesh with Nagpur as its capital: this state included the southern parts of the present-day Madhya Pradesh and northeastern portion of today's Maharashtra. In 1956, this state was reorganised and its parts were combined with the states of Madhya Bharat, Vindhya Pradesh and Bhopal to form the new Madhya Pradesh state, the Marathi-speaking Vidarbha region was removed and merged with the Bombay State. This state was the largest in India by area until 2000, when its southeastern Chhattisgarh region was designated a separate state.\r\n\r\nThe economy of Madhya Pradesh is the 10th-largest in India, with a gross state domestic product (GSDP) of ₹9.17 trillion (US$110 billion) and has the country's 26th highest per-capita income of ₹ 109372.[6] Madhya Pradesh ranks 23rd among Indian states in human development index.[11] Rich in mineral resources, Madhya Pradesh has the largest reserves of diamond and copper in India. 25.14% of its area is under forest cover.[12] Its tourism industry has seen considerable growth, with the state topping the National Tourism Awards in 2010–11.[13] In recent years, the state's GDP growth has been above the national average.[14] In 2019–20, state's GSDP was recorded at 9.07.[15]"
},
{
  "_id": {
    "$oid": "648af6873407e180703a1c6b"
  },
  "fileName": "Maharashtra.txt",
  "State Name": "Maharashtra",
  "contents": "Maharashtra (/məhɑːˈrɑːʃtrə/; Marathi: [məhaɾaːʂʈɾə] (listen), abbr. MH or Maha) is a state in the western peninsular region of India occupying a substantial portion of the Deccan Plateau. It is bordered by the Arabian Sea to the west, the Indian states of Karnataka and Goa to the south, Telangana to the southeast and Chhattisgarh to the east, Gujarat and Madhya Pradesh to the north, and the Indian union territory of Dadra and Nagar Haveli and Daman and Diu to the northwest.[15] The state is the second-most populous state in India and the second-most populous country subdivision globally.\r\n\r\nFor ease of administration, the state is divided into 6 divisions and 36 districts, with the state capital being Mumbai, the most populous urban area in India, and Nagpur serving as the winter capital, which also hosts the winter session of the state legislature.[16] Godavari and Krishna are the two major rivers in the state. Forests cover 16.47 per cent of the state's geographical area. The state is home to six UNESCO World Heritage Sites: Ajanta Caves, Ellora Caves, Elephanta Caves, Chhatrapati Shivaji Maharaj Terminus (formerly Victoria Terminus), The Victorian Gothic and Art Deco Ensembles of Mumbai and The Western Ghats, a heritage site made up of 39 individual properties of which 4 are in Maharashtra.[17][18]\r\n\r\nMaharashtra is the single largest contributor to India's Economy with a share of 14 per cent in all-India nominal GDP.[19][20][21] The economy of Maharashtra is the largest in India, with a gross state domestic product (GSDP) of ₹35.27 trillion (US$440 billion) and GSDP per capita of ₹242,247 (US$3,000).[7] The service sector dominates the state's economy, accounting for 69.3 per cent of the value of the output of the country. Although agriculture accounts for 12 per cent of the state GDP, it employs nearly half the population of the state.\r\n\r\nMaharashtra is one of the most industrialised states in India. The state's capital, Mumbai, is India's financial and commercial capital.[22] India's largest stock exchange Bombay Stock Exchange, the oldest in Asia, is located in the city, as is National Stock Exchange, which is the second largest stock exchange in India and one of world's largest derivatives exchanges. The state has played a significant role in the country's social and political life and is widely considered a leader in terms of agricultural and industrial production, trade and transport, and education.[23] Maharashtra is the ninth-highest ranking among Indian states in the human development index.[24]\r\n\r\nThe region that encompasses the state has a history going back many millennia. Notable dynasties that ruled the region include the Asmakas, the Mauryas, the Satavahanas, the Western Satraps, the Abhiras, the Vakatakas, the Chalukyas, the Rashtrakutas, the Western Chalukyas, the Seuna Yadavas, the Khaljis, the Tughlaqs, the Bahamanis, the Deccan sultanates, the Mughals, the Maratha Empire founded by Shivaji, and the British. Ruins, monuments, tombs, forts, and places of worship left by these rulers are dotted around the state. At the time of the Indian independence movement in the early 20th century, along with British ruled areas of Bombay presidency, and Central Provinces and Berar, the region included many British Vassal states. Among these, the erstwhile Deccan States Agency included Kolhapur, Miraj, Sangli, Aundh, Bhor, Sawantwadi and Marathwada of Hyderabad State.\r\n\r\nThe state was formed on 1 May 1960 after a long struggle for special state for Marathi language speaking people through Sanyukta maharashtra movement (transl. United Maharashtra movement)."
},
{
  "_id": {
    "$oid": "648af6873407e180703a1c6e"
  },
  "fileName": "Odisha.txt",
  "State Name": "Odisha",
  "contents": "Odisha (English: /əˈdɪsə/,[14] Odia: [oɽiˈsa] (listen)), formerly Orissa (/ɒˈrɪsə, ɔː-, oʊ-/[15] the official name until 2011), is an Indian state located in Eastern India. It is the 8th largest state by area, and the 11th largest by population. The state has the third largest population of Scheduled Tribes in India.[16] It neighbours the states of Jharkhand and West Bengal to the north, Chhattisgarh to the west, and Andhra Pradesh to the south. Odisha has a coastline of 485 kilometres (301 mi) along the Bay of Bengal in Indian Ocean.[17] The region is also known as Utkala and is mentioned by this name in India's national anthem, \"Jana Gana Mana\".[18] The language of Odisha is Odia, which is one of the Classical Languages of India.[19]\r\n\r\nThe ancient kingdom of Kalinga, which was invaded by the Mauryan Emperor Ashoka (which was again won back from them by King Kharavela) in 261 BCE resulting in the Kalinga War, coincides with the borders of modern-day Odisha.[20] The modern boundaries of Odisha were demarcated by the Indian government when Orissa Province was established on 1 April 1936, consisting of the Odia-speaking districts of Bihar and Orissa Province.[20] The first of April is celebrated as Utkala Dibasa/Odisha Day.[21] Cuttack was made the capital of the region by Anantavarman Chodaganga in c. 1135,[22] after which the city was used as the capital by many rulers, through the British era until 1948. Thereafter, Bhubaneswar became the capital of Odisha.[23] The economy of Odisha is the 16th-largest state economy in India with ₹5.86 trillion (US$73 billion) in gross domestic product and a per capita GDP of ₹127,383 (US$1,600).[5] Odisha ranks 32nd among Indian states in Human Development Index.[24]"
},
{
  "_id": {
    "$oid": "648af6873407e180703a1c6f"
  },
  "fileName": "Punjab.txt",
  "State Name": "Punjab",
  "contents": "Punjab (/pʌnˈdʒɑːb, -ˈdʒæb, ˈpʌn-/; Gurmukhi: ਪੰਜਾਬ; Shahmukhi: پنجاب; Punjabi: [pə̞ɲˈdʒäːb] (listen); also romanised as Panjāb or Panj-Āb)[b] is a geopolitical, cultural, and historical region in South Asia. It is located on the Indus Plain, comprising areas of eastern Pakistan and northwestern India. Punjab's major cities are Lahore, Faisalabad, Rawalpindi, Gujranwala, Multan, Ludhiana, Amritsar, Sialkot, Chandigarh, Shimla, Jalandhar, Gurugram, and Bahawalpur.\r\n\r\nPunjab grew out of the settlements along the five rivers, which served as an important route to the Near East as early as the ancient Indus Valley civilization, dating back to 3000 BCE,[3] and had numerous migrations by the Indo-Aryan peoples. Agriculture has been the major economic feature of the Punjab and has therefore formed the foundation of Punjabi culture, with one's social status being determined by land ownership.[3] The Punjab emerged as an important agricultural region, especially following the Green Revolution during the mid-1960s to the mid-1970s, and has been described as the \"breadbasket of both India and Pakistan.\"[3]\r\n\r\nBesides being known for agriculture and trade, the Punjab is also a region that over the centuries has experienced many foreign invasions and consequently has a long-standing history of warfare, as the region is vulnerably situated on the principal route of invasions through the northwestern frontier of the Indian subcontinent, including those of Persians, Macedonians, Scythians, Parthians, Kushans, Huns, Arabs, Turks, and Mongols until the rise of Sikh Misls and the Khalsa in the eighteenth century which promoted a lifestyle that entailed engaging in warfare to protect the land,[3][4] with the Marathas, Durranis and British invading the region in subsequent decades.\r\n\r\nThe boundaries of the region are ill-defined and focus on historical accounts and thus the geographical definition of the term \"Punjab\" has changed over time. In the 16th century Mughal Empire the Punjab region was divided into three, with the Lahore Subah in the west, the Delhi Subah in the east and the Multan Subah in the south. In British India, until the Partition of India in 1947, the Punjab Province encompassed the present-day Indian states and union territories of Punjab, Haryana, Himachal Pradesh, Chandigarh, and Delhi, and the Pakistani regions of Punjab, and Islamabad Capital Territory.\r\n\r\nThe predominant ethnolinguistic group of the Punjab region are the Punjabi people, who speak the Indo-Aryan Punjabi language. Punjabi Muslims are the majority in West Punjab (Pakistan), while Punjabi Sikhs are the majority in East Punjab (India). Other religious groups include Hinduism, Christianity, Jainism, Zoroastrianism, Buddhism, and Ravidassia."
},
{
  "_id": {
    "$oid": "648af6873407e180703a1c71"
  },
  "fileName": "Sikkim.txt",
  "State Name": "Sikkim",
  "contents": "Sikkim (/ˈsɪkɪm/; Nepali pronunciation: [ˈsikːim]) is a state in northeastern India. It borders the Tibet Autonomous Region of China in the north and northeast, Bhutan in the east, Koshi Province of Nepal in the west, and West Bengal in the south. Sikkim is also close to the Siliguri Corridor, which borders Bangladesh. Sikkim is the least populous and second smallest among the Indian states. Situated in the Eastern Himalaya, Sikkim is notable for its biodiversity, including alpine and subtropical climates, as well as being a host to Kangchenjunga, the highest peak in India and third highest on Earth.[10] Sikkim's capital and largest city is Gangtok. Almost 35% of the state is covered by Khangchendzonga National Park – a UNESCO World Heritage Site.[11]\r\n\r\nThe Kingdom of Sikkim was founded by the Namgyal dynasty in the 17th century. It was ruled by Buddhist priest-kings known as the Chogyal. It became a princely state of India in 1890. Following Indian independence, Sikkim continued its protectorate status with the Union of India after 1947 and the Republic of India after 1950. It enjoyed the highest literacy rate and per capita income among Himalayan states. In 1973, anti-royalist riots took place in front of the Chogyal's palace. In 1975, after the Indian Army took over the city of Gangtok, a referendum was held that led to the dissolution of the monarchy and Sikkim joining India as its 22nd state.[12]\r\n\r\nModern Sikkim is a multiethnic and multilingual Indian state. The official languages of the state are English, Nepali, Sikkimese, and Lepcha.[4] Additional official languages include Gurung, Limbu, Magar, Mukhia, Newari, Rai, Sherpa and Tamang for the purpose of preservation of culture and tradition in the state.[5] English is taught in schools and used in government documents. The predominant religions are Hinduism and Vajrayana Buddhism. Sikkim's economy is largely dependent on agriculture and tourism. As of 2019, the state had the fifth-smallest GDP among Indian states,[13] although it is also among the fastest-growing.[14][15]\r\n\r\nSikkim achieved its ambition to convert its agriculture to fully organic between 2003 and 2016, and became the first state in India to achieve this distinction.[16][17][18][19] It is also among India's most environmentally conscious states, having banned plastic water bottles \"in any government functions and meetings\" and polystyrene products (throughout the state).[20][21]"
},
{
  "_id": {
    "$oid": "648af6873407e180703a1c6c"
  },
  "fileName": "Himachal Pradesh.txt",
  "State Name": "Himachal Pradesh",
  "contents": "Himachal Pradesh (/hɪˌmɑːtʃəl prəˈdɛʃ/; Hindi: [ɦɪˈmäːtʃəl pɾəˈd̪eːʃ] (listen); lit. \"Snow-laden Mountain Province\"[9]) is a state in the northern part of India. Situated in the Western Himalayas, it is one of the thirteen mountain states and is characterized by an extreme landscape featuring several peaks and extensive river systems. Himachal Pradesh is the northernmost state of India and shares borders with the union territories of Jammu and Kashmir and Ladakh to the north, and the states of Punjab to the west, Haryana to the southwest, Uttarakhand to the southeast and a very narrow border with Uttar Pradesh to the south. The state also shares an international border to the east with the Tibet Autonomous Region in China. Himachal Pradesh is also known as Dev Bhoomi, meaning 'Land of Gods'[10] and Veer Bhoomi which means 'Land of the Brave'.[11]\r\n\r\nThe predominantly mountainous region comprising the present-day Himachal Pradesh has been inhabited since pre-historic times, having witnessed multiple waves of human migrations from other areas.[12] Through its history, the region was mostly ruled by local kingdoms, some of which accepted the suzerainty of larger empires. Prior to India's independence from the British, Himachal comprised the hilly regions of the Punjab Province of British India. After independence, many of the hilly territories were organized as the Chief Commissioner's province of Himachal Pradesh, which later became a union territory. In 1966, hilly areas of the neighboring Punjab state were merged into Himachal and it was ultimately granted full statehood in 1971.\r\n\r\nHimachal Pradesh is spread across valleys with many perennial rivers flowing through them. Agriculture, horticulture, hydropower, and tourism are important constituents of the state's economy. The hilly state is almost universally electrified, with 99.5% of households having electricity as of 2016. The state was declared India's second open-defecation-free state in 2016.[13] According to a survey of CMS-India Corruption Study in 2017, Himachal Pradesh is India's least corrupt state.[14][15]"
},
{
  "_id": {
    "$oid": "648af6873407e180703a1c76"
  },
  "fileName": "Uttar Pradesh.txt",
  "State Name": "Uttar Pradesh",
  "contents": "Uttar Pradesh (/ˌʊtər prəˈdɛʃ/;[13] Hindustani: [ˈʊtːəɾ pɾəˈdeːʃ] (listen), lit. 'Northern Province') is a state in northern India. With over 240 million inhabitants, it is the most populated state in India as well as the most populous country subdivision in the world.[14] It was established in 1950 after India had become a republic. It was a successor to the United Provinces established in 1935, and eventually of the United Provinces of Agra and Oudh established in 1902 from the North-Western Provinces and Oudh Province. Lucknow serves as the state capital, while Prayagraj being the judicial capital.\r\n\r\nThe state is divided into 18 divisions and 75 districts, . On 9 November 2000, a new state, Uttaranchal (now Uttarakhand), was created from Uttar Pradesh's western Himalayan hill region. The two major rivers of the state, the Ganges and its tributary Yamuna, meet at the Triveni Sangam in Prayagraj (formerly Allahabad), a Hindu pilgrimage site. Other notable rivers are Gomti and Saryu. The forest cover in the state is 6.1 per cent of the state's geographical area. The cultivable area is 82 per cent of total geographical area and net area sown is 68.5 per cent of cultivable area.[15]\r\n\r\nThe state is bordered by Rajasthan to the west, Haryana, Himachal Pradesh and Delhi to the northwest, Uttarakhand and an international border with Nepal to the north, Bihar to the east, Madhya Pradesh to the south, and touches the states of Jharkhand and Chhattisgarh to the southeast. It covers 240,928 km2 (93,023 sq mi), equal to 7.3% of the total area of India, and is the fourth-largest Indian state by area. Though long known for sugar production, the state's economy is now dominated by the services industry. The service sector comprises travel and tourism, hotel industry, real estate, insurance and financial consultancies. The economy of Uttar Pradesh is the third-largest state economy in India with ₹18.63 lakh crore (US$230 billion) in gross domestic product and a per capita GSDP of ₹68,810 (US$860).[9] President's rule has been imposed in Uttar Pradesh ten times since 1968, for different reasons and for a total of 1,700 days.[16] The state, at present, has three international airports – Chaudhary Charan Singh International Airport (Lucknow), Lal Bahadur Shastri Airport (Varanasi) and Kushinagar International Airport (Kushinagar). Prayagraj Junction is the headquarters of the North Central Railway and Gorakhpur Railway Station serves as the headquarters of the North Eastern Railway. The High Court of the state is located in Allahabad. The state contributes 80 seats and 31 seats to the lower house Lok Sabha and the upper house Rajya Sabha, respectively.\r\n\r\nInhabitants of the state are called either Awadhi, Bagheli, Bhojpuriya (Purvanchali), Braji, Bundeli, Kannauji, or Rohilkhandi depending upon their region of origin. Hinduism is practised by more than three-fourths of the population, with Islam being the next largest religious group. Hindi is the most widely spoken language and is also the official language of the state, along with Urdu. Uttar Pradesh was home to most of the mainstream political entities that have existed in ancient and medieval India including the Maurya Empire, Harsha Empire, Gupta Empire, Pala Empire, Delhi Sultanate, Mughal Empire as well as many other empires. At the time of Indian independence movement in the early 20th century, there were three major princely states in Uttar Pradesh – Ramgadi, Rampur and Benares. The state houses several holy Hindu temples and pilgrimage centres. Along with several historical, natural, and religious tourist destinations, including Agra, Aligarh, Ayodhya, Kushinagar, Mathura, Prayagraj, Varanasi and Vrindavan, Uttar Pradesh is also home to three World Heritage sites."
},
{
  "_id": {
    "$oid": "648af6873407e180703a1c73"
  },
  "fileName": "Rajasthan.txt",
  "State Name": "Rajasthan",
  "contents": "Rajasthan (Hindi: [rɑːdʒəsˈtʰɑːn] (listen); lit. 'Land of Kings')[11] is a state in northern India.[12][13][14] It covers 342,239 square kilometres (132,139 sq mi) or 10.4 per cent of India's total geographical area. It is the largest Indian state by area and the seventh largest by population. It is on India's northwestern side, where it comprises most of the wide and inhospitable Thar Desert (also known as the Great Indian Desert) and shares a border with the Pakistani provinces of Punjab to the northwest and Sindh to the west, along the Sutlej-Indus River valley. It is bordered by five other Indian states: Punjab to the north; Haryana and Uttar Pradesh to the northeast; Madhya Pradesh to the southeast; and Gujarat to the southwest. Its geographical location is 23.3 to 30.12 North latitude and 69.30 to 78.17 East longitude, with the Tropic of Cancer passing through its southernmost tip.\r\n\r\nIts major features include the ruins of the Indus Valley civilisation at Kalibangan and Balathal, the Dilwara Temples, a Jain pilgrimage site at Rajasthan's only hill station, Mount Abu, in the ancient Aravalli mountain range and eastern Rajasthan, the Keoladeo National Park of Bharatpur, a World Heritage Site[15] known for its bird life. Rajasthan is also home to three national tiger reserves, the Ranthambore National Park in Sawai Madhopur, Sariska Tiger Reserve in Alwar and the Mukundra Hills Tiger Reserve in Kota.\r\n\r\nThe state was formed on 30 March 1949 when Rajputana – the name adopted by the British Raj for its dependencies in the region[16] – was merged into the Dominion of India. Its capital and largest city is Jaipur. Other important cities are Jodhpur, Kota, Bikaner, Ajmer, Bharatpur and Udaipur. The economy of Rajasthan is the seventh-largest state economy in India with ₹10.20 lakh crore (US$130 billion) in gross domestic product and a per capita GDP of ₹118,000 (US$1,500).[17] Rajasthan ranks 29th among Indian states in human development index.[7]"
},
{
  "_id": {
    "$oid": "648af6873407e180703a1c6d"
  },
  "fileName": "Mizoram.txt",
  "State Name": "Mizoram",
  "contents": "Mizoram (English: /mɪˈzɔːrəm/ (listen)) is a state in northeast India, with Aizawl as its seat of government and capital city. The name of the state is derived from \"Mizo\", the self-described name of the native inhabitants, and \"Ram\", which in the Mizo language means \"land.\" Thus \"Mizo-ram\" means \"land of the Mizos\".[5] Within India's northeast region, it is the southernmost landlocked state, sharing borders with three of the Seven Sister States, namely Tripura, Assam and Manipur. The state also shares a 722-kilometre (449 mi) border with the neighbouring countries of Bangladesh and Myanmar.[6]\r\n\r\nLike several other northeastern states of India, Mizoram was previously part of Assam until 1972, when it was carved out as a Union Territory. In 1986 the Indian Parliament adopted the 53rd amendment of the Indian Constitution, which allowed for the creation of the State of Mizoram on 20 February 1987, as India's 23rd state.[7]\r\n\r\nAccording to a 2011 census, in that year Mizoram's population was 1,091,014. It is the 2nd least populous state in the country[8] (after Sikkim, with population of 610,577 in 2011). Mizoram spans over an area of approximately 21,087 square kilometres,[9] of which approximately 91% is forested.[10]\r\n\r\nAbout 95% of Mizoram's population descends from a diverse tribal origin. Mizos first began to settle the area in the 16th century, coming in waves of immigration from Southeast Asia. This immigration lasted through the 18th century.[11] Among all of the states of India, Mizoram has the highest concentration of tribal people. The Mizoram people are currently protected under the Indian constitution as a Scheduled Tribe.[12] Mizoram is one of three states of India with a Christian majority (87%).[13] Its people belong to various Christian denominations, being mostly Presbyterians in the north and Baptists in the south.\r\n\r\nMizoram is a highly literate agrarian economy. Slash-and-burn farming, also known as Jhoom farming is the most common form of farming.[14] In recent years, the jhoom farming practices have been steadily replaced with a significant horticulture and bamboo products industry.[15][16] The state's gross state domestic product for 2012 was estimated at ₹69.91 billion (US$880 million).[9] About 20% of Mizoram's population lives below the poverty line, with 35% rural poverty as of 2014.[17] The state has about 871 kilometres of national highways, with NH–54 and NH–150 connecting it to Assam and Manipur respectively. It is also a growing transit point for trade with Myanmar and Bangladesh.[18]"
}]